<template>
    <div class="wrapper-faq">
      <div class="container">
        <h1 class="title">
          вопрос/ответ
        </h1>
        <div class="accordions">
          <div class="accordion-item" v-for="item in accordions" :key="item.id"
            @click="OpenAccordion(item.id)">
            <div class="accordions-title d-flex justify-content-between">
              <h3 class="accordions-text">
                {{ item.title }}
              </h3>
              <div class="accordions-arrow">
                <img v-if="ActiveAccordion != item.id" src="../../assets/img/arrowAccordionNotActive.svg"
                  alt="">
                <img v-if="ActiveAccordion === item.id" src="../../assets/img/arrowAccordionActive.svg" alt="">
              </div>
            </div>
            <div class="accordions-inner" v-if="ActiveAccordion === item.id"
              :class="{ 'accordion-enter': ActiveAccordion === item.id, 'accordion-leave': ActiveAccordion !== item.id }">
              {{ item.inner }}
            </div>
          </div>
        </div>
      </div>
    </div>
  </template>


<script>
export default {

    data() {
        return {
            ActiveAccordion: 0,
            accordions:
                [
                    {
                        id: 1,
                        title: "Кто такой Рантье?",
                        inner: "Рантье – это человек, живущий на доходы с личного капитала, размещенного в прибыльных активах. До сих пор вход в этот элитный круг был доступен только обладателям крупного капитала.Благодаря платформе каждый пользователь получит возможность начать создавать бизнес-активы вне зависимости от стартовых возможностей, а также доступ к пошаговому алгоритму создания личного капитала.",
                    },
                    {
                        id: 2,
                        title: "Почему важно иметь личный капитал?",
                        inner: "Рантье – это человек, живущий на доходы с личного капитала, размещенного в прибыльных активах. До сих пор вход в этот элитный круг был доступен только обладателям крупного капитала.Благодаря платформе каждый пользователь получит возможность начать создавать бизнес-активы вне зависимости от стартовых возможностей, а также доступ к пошаговому алгоритму создания личного капитала.",
                    },
                    {
                        id: 3,
                        title: "Как приумножить свой капитал на Платформе?",
                        inner: "Рантье – это человек, живущий на доходы с личного капитала, размещенного в прибыльных активах. До сих пор вход в этот элитный круг был доступен только обладателям крупного капитала.Благодаря платформе каждый пользователь получит возможность начать создавать бизнес-активы вне зависимости от стартовых возможностей, а также доступ к пошаговому алгоритму создания личного капитала.",
                    },
                    {
                        id: 4,
                        title: "Могу ли я стать совладельцем Платформы?",
                        inner: "Рантье – это человек, живущий на доходы с личного капитала, размещенного в прибыльных активах. До сих пор вход в этот элитный круг был доступен только обладателям крупного капитала.Благодаря платформе каждый пользователь получит возможность начать создавать бизнес-активы вне зависимости от стартовых возможностей, а также доступ к пошаговому алгоритму создания личного капитала.",
                    },
                    {
                        id: 5,
                        title: "У меня есть идея/проект. Как Платформа может помочь в ее реализации?",
                        inner: "Рантье – это человек, живущий на доходы с личного капитала, размещенного в прибыльных активах. До сих пор вход в этот элитный круг был доступен только обладателям крупного капитала.Благодаря платформе каждый пользователь получит возможность начать создавать бизнес-активы вне зависимости от стартовых возможностей, а также доступ к пошаговому алгоритму создания личного капитала.",
                    }
                ]
        }
    },
    methods: {
        OpenAccordion(id) {
            if (this.ActiveAccordion === id) {
                this.ActiveAccordion = 0
            } else {
                this.ActiveAccordion = id
            }

        }
    }
}
</script>